// Загрузить контакт
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Контакт") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.Контакт);
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

// Закрыть без сохранения
//
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

// Сохранить контакты
//
&НаКлиенте
Процедура Сохранить(Команда)
	Закрыть(
		Новый Структура(
			"Идентификатор,
			|Имя,
			|Номер,
			|ЭтоГруппа",
			Идентификатор,
			Имя,
			Номер,
			ЭтоГруппа
		)
	);
КонецПроцедуры
