&НаКлиенте
Перем КэшированныеЭлементы;

// Загрузка параметров инстанса для проведения проверок функций
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Настройки") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.Настройки);
		ИдентификаторИнстаса = Параметры.Настройки.Идентификатор;
		НастройкаИнтеграцииWhatsApp = ПолучитьОбработкуОбъект();
		// Загрузить общие настройки в реально ситеме лучше хранить в более надежном месте
		ПараметрыАвторизация		= НастройкаИнтеграцииWhatsApp.ЗагрузитьОбщиеНастройки();
		// Загружаем настройки в текущий объект
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыАвторизация);
		// Загрузить контакты
		ЗагрузитьКонтакты(НастройкаИнтеграцииWhatsApp);
		// Загрузить область чата
		Сообщения 					= НастройкаИнтеграцииWhatsApp.ПолучитьМакет("CHAT").ПолучитьТекст();
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

// Установить контакт после того как документ сформируется
//
&НаКлиенте
Процедура Сообщения1ДокументСформирован(Элемент)
	АктивноеОкноCHAT = ПолучитьАктивноеОкно();
	Если НЕ ПустаяСтрока(ИдентификаторИнстаса) Тогда
		АктивноеОкноCHAT.WhatsAppChatAPI.setInstanceSettings(
			"{
			    |instanceId: '" 	+ ИдентификаторИнстаса + "',
			    |authToken: '" 		+ Токен + "',
			    |authType: '" 		+ ?(ТипАутентификации = "apiKey", ТипАутентификации, "jwt") + "',
			    |apiBaseUrl: '" 	+ БазовыйURL + "',
			    |longPollingInterval: 5000 }"
		);
		АктивноеОкноCHAT.WhatsAppChatAPI.startLongPolling();
	КонецЕсли;
	
	Если Элементы.Контакты.ТекущиеДанные <> Неопределено Тогда
		
		АктивноеОкноCHAT.WhatsAppChatAPI.setCurrentContact(
			XMLСтрока(Элементы.Контакты.ТекущиеДанные.Имя), 
			XMLСтрока(Элементы.Контакты.ТекущиеДанные.Номер)
		);
	КонецЕсли;
КонецПроцедуры

// Получить Активное окно HTML
//
&НаКлиенте
Функция ПолучитьАктивноеОкно()
	Если ЗначениеЗаполнено(КэшированныеЭлементы) Тогда
		ОбъектWindow = КэшированныеЭлементы;	
	Иначе
		КэшированныеЭлементы = Элементы.Сообщения1.Документ.parentWindow;    // IE-only 
		Если КэшированныеЭлементы = Неопределено Тогда  
			КэшированныеЭлементы = Элементы.Сообщения1.Документ.defaultView; // Другие браузеры
		КонецЕсли;
		ОбъектWindow = КэшированныеЭлементы;
	КонецЕсли;
	Возврат ОбъектWindow;
КонецФункции

// Получить модуль объекта внешней обработки
//
&НаСервере
Функция ПолучитьОбработкуОбъект()
	Возврат РеквизитФормыВЗначение("Объект");	
КонецФункции

// Установить текущий контакт для переписки
//
&НаКлиенте
Процедура КонтактыПриАктивизацииСтроки(Элемент)
	Если Элементы.Контакты.ТекущиеДанные <> Неопределено Тогда
		ТекущийИдентификаторЧата 	= Элементы.Контакты.ТекущиеДанные.Идентификатор;
		ТекущийЧат 					= Элементы.Контакты.ТекущиеДанные.Номер;
		АктивноеОкноCHAT = ПолучитьАктивноеОкно();
		АктивноеОкноCHAT.WhatsAppChatAPI.setCurrentContact(
		XMLСтрока(Элементы.Контакты.ТекущиеДанные.Имя), 
		XMLСтрока(Элементы.Контакты.ТекущиеДанные.Номер)
		);
	КонецЕсли;
КонецПроцедуры

// Загрузить контакты из API
//
&НаСервере
Процедура ЗагрузитьКонтакты(НастройкаИнтеграцииWhatsApp)
	Объект.Контакты.Очистить();
	// Загрузить контакты
	СписокКонтактов = НастройкаИнтеграцииWhatsApp.ПолучитьКонтакты(
	                	НастройкаИнтеграцииWhatsApp.СоздатьПараметрыСУ(
							ИдентификаторИнстаса,   
							Объект.ТипАутентификации,
							?(Объект.ТипАутентификации = "apiKey", Объект.КлючAPI, Объект.Токен),
							Объект.БазовыйURL,
							Объект.Порт,
							Объект.ИспользоватьSSL,
						)
					);
	// Загрузить в таблицу
	Для Каждого Контакт ИЗ СписокКонтактов.Контакты Цикл
		ЗаполнитьЗначенияСвойств(Объект.Контакты.Добавить(), Контакт);	
	КонецЦикла;
КонецПроцедуры

// Добавление нового контакта
//
&НаКлиенте
Процедура КонтактыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Контакт =  Новый Структура("Идентификатор,Имя,Номер,ЭтоГруппа");
	ОповещениеРедактированиеКонтактаЗавершение = Новый ОписаниеОповещения("РедактированиеКонтактаЗавершение", ЭтаФорма);
	ОткрытьФорму("ВнешняяОбработка.RKWA_ExetrnalProccessor.Форма.РедактированеКонтакта", Новый Структура("Контакт", Контакт),,,,, ОповещениеРедактированиеКонтактаЗавершение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

// Редактирование контакта
//
&НаКлиенте
Процедура КонтактыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Контакт =  Новый Структура("Идентификатор,Имя,Номер,ЭтоГруппа");
	ЗаполнитьЗначенияСвойств(Контакт, Элементы.Контакты.ТекущиеДанные);
	ОповещениеРедактированиеКонтактаЗавершение = Новый ОписаниеОповещения("РедактированиеКонтактаЗавершение", ЭтаФорма);
	ОткрытьФорму("ВнешняяОбработка.RKWA_ExetrnalProccessor.Форма.РедактированеКонтакта", Новый Структура("Контакт", Контакт),,,,, ОповещениеРедактированиеКонтактаЗавершение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

// Запись контакта в БД
//
&НаКлиенте
Процедура РедактированиеКонтактаЗавершение(Параметры, ДополнительныеПараметры) Экспорт
	Если Параметры <> Неопределено Тогда
		ЗаписьКонтактаВБД(Параметры);
	КонецЕсли;
КонецПроцедуры

// Запись контакта в БД
//
&НаСервере
Процедура ЗаписьКонтактаВБД(Параметры)
	ИнтеграцияWhatsApp = ПолучитьОбработкуОбъект();
	Если НЕ ПустаяСтрока(Параметры.Идентификатор) Тогда
		ИнтеграцияWhatsApp.РедактироватьКонтактВБД(
			ИнтеграцияWhatsApp.СоздатьПараметрыСУ(
				ИдентификаторИнстаса,   
				Объект.ТипАутентификации,
				?(Объект.ТипАутентификации = "apiKey", Объект.КлючAPI, Объект.Токен),
				Объект.БазовыйURL,
				Объект.Порт,
				Объект.ИспользоватьSSL,
			),
			Параметры,
			Параметры.Идентификатор
		);	
	Иначе
		ИнтеграцияWhatsApp.ДобавитьКонтактВБД(
			ИнтеграцияWhatsApp.СоздатьПараметрыСУ(
				ИдентификаторИнстаса,   
				Объект.ТипАутентификации,
				?(Объект.ТипАутентификации = "apiKey", Объект.КлючAPI, Объект.Токен),
				Объект.БазовыйURL,
				Объект.Порт,
				Объект.ИспользоватьSSL,
			),
			Параметры
		);
	КонецЕсли;
	ЗагрузитьКонтакты(ИнтеграцияWhatsApp);
КонецПроцедуры

// Удаление контакта из ДБ
//
&НаКлиенте
Процедура КонтактыПередУдалением(Элемент, Отказ)
	Если Элементы.Контакты.ТекущиеДанные <> Неопределено Тогда
		КонтактыПередУдалениемСервер(Элементы.Контакты.ТекущиеДанные.Идентификатор);	
	КонецЕсли;
КонецПроцедуры

// Удаление контакта из ДБ
//
&НаСервере
Процедура КонтактыПередУдалениемСервер(Идентификатор)
	НастройкаИнтеграцииWhatsApp = ПолучитьОбработкуОбъект();
	НастройкаИнтеграцииWhatsApp.УдалитьКонтактИзБД(
		НастройкаИнтеграцииWhatsApp.СоздатьПараметрыСУ(
			ИдентификаторИнстаса,   
			Объект.ТипАутентификации,
			?(Объект.ТипАутентификации = "apiKey", Объект.КлючAPI, Объект.Токен),
			Объект.БазовыйURL,
			Объект.Порт,
			Объект.ИспользоватьSSL,
		),
		Идентификатор
	);
КонецПроцедуры

// Загрузить историю сообщения по Идентификатору чата
//
&НаКлиенте
Процедура ЗагрузитьИсториюЧата(ИдентификаторЧата)
	АктивноеОкноCHAT = ПолучитьАктивноеОкно();
	АктивноеОкноCHAT.WhatsAppChatAPI.clearMessages();
	
	//WhatsAppChatAPI.setCurrentContact('Иван Иванов', '+7 (123) 456-78-90');
	
	//WhatsAppChatAPI.addIncomingMessage('Привет! Как дела?', '10:15');
	
	//WhatsAppChatAPI.addMessages([
	//    {
	//        type: "incoming",
	//        text: "Привет! У меня есть для тебя документы."
	//    },
	//    {
	//        type: "incoming",
	//        text: "Вот договор, посмотри, пожалуйста.",
	//        fileUrl: "https://example.com/files/contract.pdf",
	//        fileName: "Договор.pdf",
	//        fileSize: 1048576, // 1 МБ
	//        mimeType: "application/pdf"
	//    },
	//    {
	//        type: "outgoing",
	//        text: "Спасибо, сейчас посмотрю!"
	//    },
	//    {
	//        type: "outgoing",
	//        text: "Всё выглядит хорошо. Вот подписанная версия.",
	//        type: "file",
	//        fileName: "Договор_подписанный.pdf",
	//        fileSize: 1124000,
	//        fileUrl: "https://example.com/files/signed_contract.pdf"
	//    }
	//]);
КонецПроцедуры

//// Отправка текстового сообщения через API
//WhatsAppChatAPI.sendMessage(
//    "+79123456789", // Номер телефона
//    "Добрый день! Напоминаем о встрече завтра в 15:00.",
//    function(success, response) {
//        if (success) {
//            console.log("Сообщение успешно отправлено!", response);
//        } else {
//            console.error("Ошибка при отправке:", response);
//        }
//    }
//);

//// Отправка файла через API
//WhatsAppChatAPI.sendFile(
//    "+79123456789",
//    "https://example.com/files/invoice.pdf",
//    "Вот счет за прошлый месяц", // Подпись к файлу (необязательно)
//    function(success, response) {
//        if (success) {
//            console.log("Файл успешно отправлен!", response);
//        } else {
//            console.error("Ошибка при отправке файла:", response);
//        }
//    }
//);
// Отправить текстовое сообщение
//
&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
	АктивноеОкноCHAT = ПолучитьАктивноеОкно();
	АктивноеОкноCHAT.WhatsAppChatAPI.addOutgoingTextMessage(Сообщение);
	Сообщение = "";
КонецПроцедуры

// Отправить текстовое сообщение
//
&НаСервере
Процедура ОтправитьНаСервере()
	Если Не ПустаяСтрока(Сообщение) Тогда
		ИнтеграцияWhatsApp = ПолучитьОбработкуОбъект();
		ИнтеграцияWhatsApp.ОтправитьСообщение(
			ТекущийИдентификаторЧата,
			Сообщение,
			ИнтеграцияWhatsApp.СоздатьПараметрыСУ(
				ИдентификаторИнстаса,   
				Объект.ТипАутентификации,
				?(Объект.ТипАутентификации = "apiKey", Объект.КлючAPI, Объект.Токен),
				Объект.БазовыйURL,
				Объект.Порт,
				Объект.ИспользоватьSSL,
			)
		);		
	КонецЕсли;
КонецПроцедуры

// Выбрать файл для отправки
//
&НаКлиенте
Процедура ОтправитьФайл(Команда)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = НСтр("ru='All (*.*)|*.*");
	Диалог.Заголовок = НСтр("ru='Выберите файл'");
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры

// Загрузить файл для отправки
//
&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;
	ДанынеФайла = Новый ДвоичныеДанные(ВыбранныеФайлы[0]);
	ОтправитьФайлНаСервере(ДанынеФайла,СтрРазделить(ВыбранныеФайлы[0], "\")[СтрРазделить(ВыбранныеФайлы[0], "\").Количество() - 1])
КонецПроцедуры

// Отправить файл
//
&НаСервере
Процедура ОтправитьФайлНаСервере(ДанынеФайла, ИмяФайла = "123.txt")
	Если Не ПустаяСтрока(ДанынеФайла) Тогда
		ИнтеграцияWhatsApp = ПолучитьОбработкуОбъект();
		ИнтеграцияWhatsApp.ОтправитьФайл(
			ТекущийИдентификаторЧата,
			ДанынеФайла,
			ИмяФайла,
			ИнтеграцияWhatsApp.СоздатьПараметрыСУ(
				ИдентификаторИнстаса,   
				Объект.ТипАутентификации,
				?(Объект.ТипАутентификации = "apiKey", Объект.КлючAPI, Объект.Токен),
				Объект.БазовыйURL,
				Объект.Порт,
				Объект.ИспользоватьSSL,
			),
			Сообщение
		);		
	КонецЕсли;
КонецПроцедуры



