// Проверка авторизации
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастройкаИнтеграцииWhatsApp = ПолучитьОбработкуОбъект();
	// Загрузить общие настройки в реально ситеме лучше хранить в более надежном месте
	ПараметрыАвторизация		= НастройкаИнтеграцииWhatsApp.ЗагрузитьОбщиеНастройки();
	// Загружаем настройки в текущий объект
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыАвторизация);
	// Обновляем видимость групп
	ОбновитьВидимостьЭлементов(Объект.Авторизован);
	// Загружаем инстансы
	ЗагрузистьИнстаксы(НастройкаИнтеграцииWhatsApp);
КонецПроцедуры

&НаКлиенте
Процедура ТипАутентификацииПриИзменении(Элемент)
	// Обновляем видимость групп
	ОбновитьВидимостьЭлементов(Объект.Авторизован);
КонецПроцедуры

// Обновить видимость элементов формы
//	
//	Параметры:
//		СтатусАвторизации - Булево, определяет авторизован пользователь или нет
//
Процедура ОбновитьВидимостьЭлементов(СтатусАвторизации) Экспорт
	// Видимость окна входа
	Если СтатусАвторизации Тогда
		Элементы.Авторизация.Видимость 	= Ложь;
		Элементы.Настройки.Видимость	= Истина;
	Иначе
		Элементы.Авторизация.Видимость 	= Истина;
		Элементы.Настройки.Видимость	= Ложь;
	КонецЕсли;	
	// Видимость полей авторизции
	Если Объект.ТипАутентификации = "apiKey" ИЛИ ПустаяСтрока(Объект.ТипАутентификации) Тогда
		Элементы.Пользователь.Видимость = Ложь;	
		Элементы.Пароль.Видимость 		= Ложь;
		Элементы.КлючAPI.Видимость		= Истина;
	Иначе
		Элементы.Пользователь.Видимость = Истина;	
		Элементы.Пароль.Видимость 		= Истина;
		Элементы.КлючAPI.Видимость		= Ложь;
	КонецЕсли;
КонецПроцедуры

// Получить модуль объекта внешней обработки
//
&НаСервере
Функция ПолучитьОбработкуОбъект()
	Возврат РеквизитФормыВЗначение("Объект");	
КонецФункции

// Сохранить общие настройки
//
&НаКлиенте
Процедура СохранитьПараметрыАвторизации(Команда)
	СохранитьПараметрыАвторизацииНаСервере();
КонецПроцедуры

// Сохранить общие настройки
//
&НаСервере
Процедура СохранитьПараметрыАвторизацииНаСервере()
	НастройкаИнтеграцииWhatsApp = ПолучитьОбработкуОбъект();
	// Сохранить общие настройки
	НастройкаИнтеграцииWhatsApp.СохранитьОбщиеНастройки(,,
		Новый Структура(
			"Пользователь,
			|Пароль,
			|КлючAPI,
			|Авторизован,
			|БазовыйURL,
			|Порт,
			|ИспользоватьSSL,
			|ТипАутентификации",
			Объект.Пользователь,
			Объект.Пароль,
			Объект.КлючAPI,
			Объект.Авторизован,
			Объект.БазовыйURL,
			Объект.Порт,
			Объект.ИспользоватьSSL,
			"none"
		)
	);
КонецПроцедуры

// Авторизация
//
&НаКлиенте
Процедура Вход(Команда)
	ВходНаСервере();
КонецПроцедуры

// Авторизация
//
&НаСервере
Процедура ВходНаСервере()
	НастройкаИнтеграцииWhatsApp = ПолучитьОбработкуОбъект();
	// Выполнить Авторизацию
	РезультатАвторизации = НастройкаИнтеграцииWhatsApp.ВыполнитьАвторизацию(
								Объект.Пользователь, 
								Объект.Пароль, 
								Новый Структура(
									"baseurl,
									|port,
									|useSSL,
									|authType",
									Объект.БазовыйURL,
									Объект.Порт,
									Объект.ИспользоватьSSL,
									Объект.ТипАутентификации
								)
							);
	Если РезультатАвторизации.Успех Тогда
		// Заполнить текущий объект
		ЗаполнитьЗначенияСвойств(Объект, РезультатАвторизации);
		Объект.Авторизован = Истина;
	КонецЕсли;
	// Обновляем видимость групп
	ОбновитьВидимостьЭлементов(Объект.Авторизован);
	// Загружаем инстансы
	ЗагрузистьИнстаксы(НастройкаИнтеграцииWhatsApp);
КонецПроцедуры

// Загрузить инстансы
//
&НаСервере
Процедура ЗагрузистьИнстаксы(НастройкаИнтеграцииWhatsApp)
	Если Объект.Авторизован Тогда
		Объект.НастройкиWhatsApp.Очистить();
		// Загружаем инстансы
		СпискиИнстансов = НастройкаИнтеграцииWhatsApp.ПолучитьСписокИнстансов(
			НастройкаИнтеграцииWhatsApp.СоздатьПараметрыСУ(
				"",   
				Объект.ТипАутентификации,
				?(Объект.ТипАутентификации = "apiKey", Объект.КлючAPI, Объект.Токен),
				Объект.БазовыйURL,
				Объект.Порт,
				Объект.ИспользоватьSSL,
			)
		);
		Если  СпискиИнстансов.Инстансы <> Неопределено Тогда
			// Загрузить в таблицу
			Для Каждого Инстанс ИЗ СпискиИнстансов.Инстансы Цикл
				ЗаполнитьЗначенияСвойств(Объект.НастройкиWhatsApp.Добавить(), Инстанс);	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Открыть параметры инстанса
//
&НаКлиенте
Процедура НастройкиWhatsAppВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НастройкиИнстанса = Новый Структура("НомерСтроки,Идентификатор,Наименование,Описание,ИдПользователя,Статус,QRКод,АдресВебхука,ВебхукВключен,ОтправленоСообщений,ПолученоСообщений,ДатаПоследнейАктивности,ДатаСоздания,ДатаОбновления");
	ЗаполнитьЗначенияСвойств(НастройкиИнстанса, Элементы.НастройкиWhatsApp.ТекущиеДанные);
	ОповещенияИзмененияИнстансаЗавершение = Новый ОписаниеОповещения("ИзменениеИнстансаЗавершение", ЭтаФорма);
	ОткрытьФорму("ВнешняяОбработка.RKWA_ExetrnalProccessor.Форма.НастройкаИнстанса", Новый Структура("Настройки", НастройкиИнстанса),,,,, ОповещенияИзмененияИнстансаЗавершение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

// Сохдание инстанса
//
&НаКлиенте
Процедура НастройкиWhatsAppПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	НастройкиИнстанса = Новый Структура("НомерСтроки,Идентификатор,Наименование,Описание,ИдПользователя,Статус,QRКод,АдресВебхука,ВебхукВключен,ОтправленоСообщений,ПолученоСообщений,ДатаПоследнейАктивности,ДатаСоздания,ДатаОбновления");
	ОповещенияИзмененияИнстансаЗавершение = Новый ОписаниеОповещения("ИзменениеИнстансаЗавершение", ЭтаФорма);
	ОткрытьФорму("ВнешняяОбработка.RKWA_ExetrnalProccessor.Форма.НастройкаИнстанса", Новый Структура("Настройки", НастройкиИнстанса),,,,, ОповещенияИзмененияИнстансаЗавершение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

// Записать параметры инстанса
//
&НаКлиенте
Процедура ИзменениеИнстансаЗавершение(Параметры, ДополнительныеПараметры) Экспорт
	Если Параметры <> Неопределено Тогда
		ЗаписатьИзмененияИнстанса(Параметры);
	КонецЕсли;
КонецПроцедуры

// Загрузить инстансы
//
&НаСервере
Процедура ЗаписатьИзмененияИнстанса(Параметры)
	НастройкаИнтеграцииWhatsApp = ПолучитьОбработкуОбъект();
	Если НЕ ПустаяСтрока(Параметры.Идентификатор) Тогда
		НастройкаИнтеграцииWhatsApp.ОбновитьИнстанс(
			НастройкаИнтеграцииWhatsApp.СоздатьПараметрыСУ(
				Параметры.Идентификатор,   
				Объект.ТипАутентификации,
				?(Объект.ТипАутентификации = "apiKey", Объект.КлючAPI, Объект.Токен),
				Объект.БазовыйURL,
				Объект.Порт,
				Объект.ИспользоватьSSL,
			),
			Параметры,
			Параметры.Идентификатор
		);	
	Иначе
		НастройкаИнтеграцииWhatsApp.СоздатьИнстанс(
			НастройкаИнтеграцииWhatsApp.СоздатьПараметрыСУ(
				"",   
				Объект.ТипАутентификации,
				?(Объект.ТипАутентификации = "apiKey", Объект.КлючAPI, Объект.Токен),
				Объект.БазовыйURL,
				Объект.Порт,
				Объект.ИспользоватьSSL,
			),
			Параметры
		);
	КонецЕсли;
	ЗагрузистьИнстаксы(НастройкаИнтеграцииWhatsApp);
КонецПроцедуры

// Удаление инстанса
//
&НаКлиенте
Процедура НастройкиWhatsAppПередУдалением(Элемент, Отказ)
	Если Элементы.НастройкиWhatsApp.ТекущиеДанные <> Неопределено Тогда
		НастройкиWhatsAppПередУдалениемНаСервере(Элементы.НастройкиWhatsApp.ТекущиеДанные.Идентификатор);
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

// Удаление инстанса
//
&НаСервере
Процедура НастройкиWhatsAppПередУдалениемНаСервере(Идентификатор)
	 НастройкаИнтеграцииWhatsApp = ПолучитьОбработкуОбъект();
	 НастройкаИнтеграцииWhatsApp.УдалитьИнстанс(
		НастройкаИнтеграцииWhatsApp.СоздатьПараметрыСУ(
			Идентификатор,   
			Объект.ТипАутентификации,
			?(Объект.ТипАутентификации = "apiKey", Объект.КлючAPI, Объект.Токен),
			Объект.БазовыйURL,
			Объект.Порт,
			Объект.ИспользоватьSSL,
		)
	);
	ЗагрузистьИнстаксы(НастройкаИнтеграцииWhatsApp);
КонецПроцедуры

// Открыть примеры интеграции для Инстанса
//
&НаКлиенте
Процедура Примеры(Команда)
	Если Элементы.НастройкиWhatsApp.ТекущиеДанные <> Неопределено Тогда
		НастройкиИнстанса = Новый Структура("НомерСтроки,Идентификатор,Наименование,Описание,ИдПользователя,Статус,QRКод,АдресВебхука,ВебхукВключен,ОтправленоСообщений,ПолученоСообщений,ДатаПоследнейАктивности,ДатаСоздания,ДатаОбновления");
		ЗаполнитьЗначенияСвойств(НастройкиИнстанса, Элементы.НастройкиWhatsApp.ТекущиеДанные);
		НастройкиИнстанса.Вставить("authToken"	, ?(Объект.ТипАутентификации = "apiKey", Объект.КлючAPI, Объект.Токен));
		НастройкиИнстанса.Вставить("authType"	, Объект.ТипАутентификации);
		НастройкиИнстанса.Вставить("apiBaseUrl"	, Объект.БазовыйURL);
		ОткрытьФорму("ВнешняяОбработка.RKWA_ExetrnalProccessor.Форма.ПримерыДляИнстанса", Новый Структура("Настройки", НастройкиИнстанса),,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;	
КонецПроцедуры


