&НаКлиенте
Перем КэшированныеЭлементы;

// Загрузить настройки Инстанса
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Настройки") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.Настройки);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	// Получить макет для QR
	МодульОбъектаОбработки 	= ПолучитьОбработкуОбъект();
	ПолеQR 					= МодульОбъектаОбработки.ПолучитьМакет("QR").ПолучитьТекст();
КонецПроцедуры

// Выйти без записи изменений
//
&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры

// Сохранить изменения
//
&НаКлиенте
Процедура Записать(Команда)
	НастройкиИнстанса = Новый Структура("НомерСтроки,Идентификатор,Наименование,Описание,ИдПользователя,Статус,QRКод,АдресВебхука,ВебхукВключен,ОтправленоСообщений,ПолученоСообщений,ДатаПоследнейАктивности,ДатаСоздания,ДатаОбновления");
	ЗаполнитьЗначенияСвойств(НастройкиИнстанса, ЭтаФорма);
	Закрыть(НастройкиИнстанса);
КонецПроцедуры

// Получить модуль объекта внешней обработки
//
&НаСервере
Функция ПолучитьОбработкуОбъект()
	Возврат РеквизитФормыВЗначение("Объект");	
КонецФункции

// Загрузить макет для QR
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 
КонецПроцедуры

// Отобразить QR
//
&НаКлиенте
Процедура ПолеQRДокументСформирован(Элемент)
	Если НЕ ПустаяСтрока(Идентификатор) Тогда
		СтрокаПередачи = Строка(QRКод);
		АктивноеОкноQR = ПолучитьАктивноеОкно();
		АктивноеОкноQR.displayQRCode(XMLСтрока(Статус), СтрокаПередачи);
	КонецЕсли;
КонецПроцедуры

// Получить Активное окно HTML
//
&НаКлиенте
Функция ПолучитьАктивноеОкно()
	Если ЗначениеЗаполнено(КэшированныеЭлементы) Тогда
		ОбъектWindow = КэшированныеЭлементы;	
	Иначе
		КэшированныеЭлементы = Элементы.ПолеQR.Документ.parentWindow;    // IE-only 
		Если КэшированныеЭлементы = Неопределено Тогда  
			КэшированныеЭлементы = Элементы.ПолеQR.Документ.defaultView; // Другие браузеры
		КонецЕсли;
		ОбъектWindow = КэшированныеЭлементы;
	КонецЕсли;
	Возврат ОбъектWindow;
КонецФункции

// Отключить инстанс
//
&НаКлиенте
Процедура Отключить(Команда)
	ОтключитьНаСервере();
КонецПроцедуры

// Отключить инстанс
//
&НаСервере
Процедура ОтключитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры
